---
type: Ellipse
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# Ellipse

`Autodesk.Revit.DB.Ellipse` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateCurve | 2017_subscription_update | `public static Curve CreateCurve ( XYZ center , double xRadius , double yRadius , XYZ xAxis , XYZ yAxis , double startParameter , double endParameter )` |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Property | Center | — | `public XYZ Center { get ; }` |
| Property | Normal | — | `public XYZ Normal { get ; }` |
| Property | RadiusX | — | `public double RadiusX { get ; }` |
| Property | RadiusY | — | `public double RadiusY { get ; }` |
| Property | XDirection | 2013 | `public XYZ XDirection { get ; }` |
| Property | YDirection | 2013 | `public XYZ YDirection { get ; }` |